{
    "competitions": {
        "Aerospace Engineering": [
            "Genes in Space: Students design and propose experiments to study the effects of microgravity on living organisms, with the goal of advancing our understanding of the biological effects of space travel and potentially contributing to the development of new technologies for space exploration. Winning experiments are conducted aboard the International Space Station. Open to grades 7-12 https://www.genesinspace.org/",
            "NASA App Development Challenge: Coding competition where students address real-world technical problems related to NASA's deep space exploration missions. Participants develop software applications that contribute to the Artemis program, aiming to land astronauts on the Moon and eventually Mars. Open to grades 6-12 https://www.nasa.gov/learning-resources/app-development-challenge/",
            "NSS Gerard K. O’Neill Space Settlement Contest: Annual competition that invites students to design and submit projects focused on concepts for free space settlements, permanent habitats located in space rather than on planets or moons. Participants can submit a variety of materials, including designs, research papers, essays, models, and artwork. Open to grades 12 and under https://space.nss.org/nss-space-settlement-contest/" 
        ],
        "Architecture": [
            "120 Hours Challenge: International architecture competition that challenges students to design and propose innovative solutions to a given architectural problem or brief, with a tight deadline of just 120 hours to complete the task. Requires students to think creatively, work efficiently, and produce high-quality designs that meet the needs of the brief. Open to grades 9-12 https://www.120hours.no/",
            "Architecture At Zero: International design competition focused on decarbonization, equity, and resilience. Participants are tasked with designing new buildings, such as the the Griffith STEAM Magnet Middle School in 2024. Open to grades 9-12 https://www.architectureatzero.com/",
            "International Bridge Building Contest: Challenges high school students to design, construct, and test model bridges that adhere to specific engineering specifications. The competition emphasizes the application of physics and engineering principles, encouraging students to develop efficient and innovative bridge designs. Open to grades 9-12 http://bridgecontest.phys.iit.edu/",
            "The Architect's Chair: Design competition that challenges participants to create innovative and functional furniture designs, with a focus on sustainability, aesthetics, and user experience. Open to grades 9-12 https://architecturecompetitions.com/thearchitectschair",
            "Last Nuclear Bomb Memorial Competition: International architecture competition invites participants to design a memorial situated within a decommissioned nuclear weapon testing site. The objective is to reflect on the history and ongoing threat of nuclear weapons, promoting public awareness and advocating for disarmament. Open to all students https://architecturecompetitions.com/nuclearbombmemorial3/",
            "Legendary Highway 14 Tower Competition: Design challenge that asks students to envision and propose a iconic and functional tower structure along Highway 14, with the goal of creating a landmark that showcases innovative design, sustainability, and community engagement. The competition requires students to consider the tower's relationship to its surroundings, its potential impact on the local environment and community, and its ability to serve as a symbol of innovation. Open to grades 9-12 https://architecturecompetitions.com/highwaytower14/",
            "Los Angeles Affordable Housing Competition: Design challenge that asks students to develop innovative and sustainable solutions to address the affordable housing crisis in Los Angeles. The competition requires students to consider the complex social, economic, and environmental factors that contribute to the housing crisis, and to design solutions that are not only aesthetically pleasing but also functional. Open to grades 9-12 https://architecturecompetitions.com/losangeleschallenge/"
        ],
        "Art": [
            "Congressional Art Competition: Annual event that allows students from across the United States to showcase their artistic talents. Each congressional district hosts its own competition, with winning artworks displayed in the U.S. Capitol for one year. Open to grades 9-12 https://www.house.gov/educators-and-students/congressional-art-competition",
            "National Scholastic Art & Writing Awards: Recognizes creative excellence in visual arts and writing, offering students opportunities for scholarships and national recognition. Open to grades 7-12 https://www.artandwriting.org/awards/how-to-enter/",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18) https://youngarts.org/"
        ],
        "Astronomy": [
            "International Astronomy and Astrophysics Competition (IAAC): Global online competition that challenges students to demonstrate their knowledge and skills in astronomy and astrophysics. The competition features a series of questions and problems that test students' understanding of astronomical concepts, theories, and phenomena, as well as their ability to think critically and solve complex problems. Open to grades 12 and under https://iaac.space/en/",
            "International Space Olympiad (ISO): Global online competition that tests students' knowledge and skills in space science, astronomy, and related fields. Features a range of challenges and activities, including quizzes and presentations that require students to demonstrate their understanding of space-related concepts, theories, and technologies. Open to grades 5-12 https://internationalspaceolympiad.com/",
            "International Olympiad on Astronomy and Astrophysics (IOAA) (Difficulty ★★★★★): Tests students' knowledge in the fields of astronomy and astrophysics. Participants engage in theoretical, observational, and data analysis problems, challenging them to apply advanced concepts, think critically, and solve complex, real-world astronomical scenarios. Open to grades 9-12 https://www.ioaastrophysics.org/"  
        ],
        "Biology": [
            "AnatoBee (Difficulty ★★★★☆): Tests students' knowledge of human anatomy, embryology, and histology through a series of challenging questions and interactive activities. Participants engage in online quizzes and exams that assess their understanding of anatomical structures and physiological functions. Open to grades 9-12 https://anatobee.org/", 
            "BioGENEius Challenge: Conduct innovative research in biotechnology, covering fields like healthcare, agriculture, and environmental sustainability. Students present their research to industry leaders and compete at national and international levels. Open to grades 9-12 https://biotechinstitute.org/biogeneius/", 
            "Brain Bee (Difficulty ★★★☆☆): Neuroscience competition that tests knowledge of the brain, nervous system, and neurological diseases. Aims to inspire students to pursue careers in neuroscience and medicine through competitive experiences. Open to grades 9-12 https://www.thebrainbee.org/", 
            "Genes in Space: Students design and propose experiments to study the effects of microgravity on living organisms, with the goal of advancing our understanding of the biological effects of space travel and potentially contributing to the development of new technologies for space exploration. Winning experiments are conducted aboard the International Space Station. Open to grades 7-12 https://www.genesinspace.org/",
            "International Genetically Engineered Machine (iGEM): Global synthetic biology competition where teams design and build innovative biological systems using genetic engineering. Fosters collaboration, research, and problem-solving to address real-world challenges in healthcare, sustainability, and technology. Open to grades 9-12 https://competition.igem.org/", 
            "USA Biology Olympiad (USABO) (Difficulty ★★★★☆): Challenges students on advanced biological concepts through rigorous exams, with top students advancing to represent the US at the International Biology Olympiad. Open to grades 9-12 https://www.usabo-trc.org/"
        ],
        "Business & Finance": [
            "Blue Ocean Student Entrepreneurship Challenge (Difficulty ★★★★☆): Largest virtual entrepreneurship competition where participants develop and pitch innovative business ideas using Blue Ocean Strategy principles in order to gain real entrepreneurship experience. Open to grades 9-12 https://blueoceancompetition.org/", 
            "Conrad Challenge: Entrepreneurship competition that encourages high school students to develop creative solutions to global challenges. Participants work in teams to design, research, and present their ideas, gaining mentorship and the opportunity to bring their ideas into fruition. Open to ages 13-18 https://www.conradchallenge.org/", 
            "DECA Competitive Events: Test students' skills and knowledge in marketing, management, and entrepreneurship, with events ranging from written exams and role-playing scenarios to presentations and case studies, all designed to simulate real-world business situations. Open to grades 9-12 https://www.deca.org/compete",
            "Diamond Challenge for High School Entrepreneurs (Difficulty ★★★★☆): Global entrepreneurship competition where students develop and pitch unique business ideas. Participants create business models and compete for funding, mentorship, and networking opportunities to bring their ideas to life. Open to grades 9-12 https://diamondchallenge.org/",
            "International Economics Olympiad: Global competition that tests students' knowledge of economics, including microeconomics, macroeconomics, and international trade. Participants go through multiple rounds of online challenges, case studies, and exams, competing to showcase their economics proficiency. Open to grades 9-12 https://ieo-official.org/",
            "Microsoft Imagine Cup Junior (Difficulty ★★★★★): Global technology competition that empowers student developers to create innovative applications addressing real-world challenges. Participants utilize Microsoft technologies to transform their ideas into market-ready solutions. Open to ages 13-18 https://imaginecup.microsoft.com/en-us/junior",
            "National Business Plan Competition: Prestigious event that brings together student entrepreneurs from across the country to showcase their innovative business ideas and compete for top honors, with the goal of fostering a spirit of entrepreneurship and innovation among young people. Requires students to develop a comprehensive business plan, including market analysis and strategies, and then present their plans to a panel of judges. Requires qualification from Local and Regional Business Plan Competitions. Open to grades 9-12 https://www.competitionsciences.org/competitions/national-business-plan-competition/",
            "NFTE World Series of Innovation: Invites students to get involved in solving some of the biggest challenges humanity faces today and advance the UN Sustainable Development Goals. Participants submit business ideas with their solutions to real-world problems. Open to grades 9-12 https://innovation.nfte.com/", 
            "NFTE Youth Entrepreneurship Challenge: Participants create and pitch their own business ideas, showcasing their entrepreneurial skills and innovation. Students go through workshops and mentoring to build their ideas, competing for seed capital to launch their business or pursue educational goals. Open to grades 9-12 https://nfte.com/",
            "Trading Day Competition: Simulated trading competition that challenges students to make investment decisions and manage a virtual portfolio, with the goal of earning the highest returns and outperforming their peers. The competition provides a realistic and interactive learning experience, where students can apply their knowledge of finance, economics, and investing to make informed decisions. Open to grades 10 and 11 https://www.stevens.edu/school-business-high-school-programs-trading-day", 
            "Wharton Global High School Investment Competition (Difficulty ★★★★☆): Teams manage a virtual portfolio, making investment decisions based on market conditions and economic factors. Teams compete for the best portfolio performance while gaining valuable experience in financial analysis and decision-making. Open to grades 9-12 https://globalyouth.wharton.upenn.edu/competitions/investment-competition/",
            "Young Investors Society Global Stock Pitch Competition: International competition where students research, analyze, and pitch stock investment ideas in a written report to a panel of judges. Participants demonstrate their understanding of financial markets by providing thorough analyses and presenting compelling investment cases for global companies. Open to grades 9-12 https://yis.org/programs/stock-pitch-competition/"
        ],
        "Chemistry": [
            "ChemiCo: International Olympiad-style chemistry competition that challenges students worldwide on fundamental chemistry concepts, including stoichiometry, reactions, the periodic table, atomic structure, chemical bonding, and experimental chemistry. Open to grades 9-12 https://stemco.org/chemico/",
            "USA National Chemistry Olympiad: Challenges students with advanced chemistry concepts through rigorous exams, with top performers advancing to represent the US at the International Chemistry Olympiad. Open to grades 9-12 https://www.acs.org/education/olympiad.html"
        ],
        "Civics Knowledge & Engagement": [
            "Bill of Rights Institute MyImpact Challenge: Encourages students to design and implement projects that create positive change in their communities, reflecting the principles of the Constitution and civic responsibility. Open to ages 13-19 https://www.billofrightsinstitute.org/my-impact-challenge", 
            "National High School Mock Trial Championship: Nationwide competition where teams simulate courtroom trials, applying legal principles and presenting cases in front of real judges and attorneys. Open to grades 9-12 https://www.nationalmocktrial.org/", 
            "Ninth Circuit Civics Contest (Difficulty ★★★☆☆): Invites students submit an essay or video on topics related to the US Constitution and the justice system, encouraging civic engagement and understanding of constitutional principles. Open to grades 9-12 in the western US or Pacific Islands https://www.ca9.uscourts.gov/civicscontest/", 
            "Sandra Day O'Connor Civics Challenge (Difficulty ★★★☆☆): Challenges students to express their civics knowledge of the US government and US Constitution through essays, videos, music, and poetry. Open to grades 6-12 https://oconnorinstitute.org/cc/", 
            "VFW Voice of Democracy Program: Provides students with the unique opportunity to express themselves in regards to a democratic and patriotic-themed recorded essay based on this year's theme. Open to grades 9-12 https://www.vfw.org/community/youth-and-education/youth-scholarships", 
            "We The Students Scholarship Contest: Challenges students to write about a current event or issue related to the U.S. Constitution and their rights as citizens. Open to grades 8-12 (ages 14-19) https://studentscholarships.org/scholarship/9432/we-the-students-scholarship-contest"
        ],
        "Computer Science": [
            "American Computer Science League (ACSL): Tests students on fundamental concepts in computer science, ranging from number systems to boolean algebra to digital electronics. In the upper divisions, each contest also includes a problem to solve by programming using Python, C++ or Java. Open to grades K-12 https://www.acsl.org/",
            "Congressional App Challenge (Difficulty ★★☆☆☆): Invites students in the U.S. to submit their apps to be judged by a congressman/woman; winners get their apps displayed in the U.S. Capitol. Open to grades 6-12 https://www.congressionalappchallenge.us/",
            "NASA App Development Challenge: Coding competition where  students address real-world technical problems related to NASA's deep space exploration missions. Participants develop software applications that contribute to the Artemis program, aiming to land astronauts on the Moon and eventually Mars. Open to grades 6-12 https://www.nasa.gov/learning-resources/app-development-challenge/",
            "USA Computing Olympiad (Difficulty ★★★★★): Prestigious competitive programming contest for students that challenges participants to solve complex algorithmic problems and serves as a pathway to the International Olympiad in Informatics. Open to all ages and grades; however, only pre-college students are eligible for the IOI https://usaco.org/"
        ],
        "Cybersecurity": [
            "CyberPatriot National Youth Cyber Defense Competition: Nation's largest cyber defense competition where teams act as newly hired IT professionals tasked with managing and securing the network of a small company. They are provided with virtual operating systems containing cybersecurity vulnerabilities and must find and fix these issues while maintaining critical services. Open to grades K-12 https://www.uscyberpatriot.org/",
            "National Cyber League: Competitions are held multiple times a year where participants solve cybersecurity problems and are scored based on accuracy and completion; participants are given a rank depending on where they place overall. Open to ages 13 and older https://nationalcyberleague.org/competition",
            "picoCTF - CMU Cybersecurity Competition (Difficulty ★★★★★): Participants solve problems through Capture The Flag (CTF) format in cryptography, reverse engineering, web exploitation, and forensics while developing real-world cybersecurity skills. Open to ages 13 and older https://picoctf.org/"
        ],
        "Economics": [
            "High School Fed Challenge: Academic competition that encourages students to deepen their understanding of economics and the Federal Reserve's role in the U.S. economy. Teams conduct research on a designated economic theme, develop analyses, and present their findings through analytical writing. Open to grades 9-12 https://www.newyorkfed.org/outreach-and-education/high-school/high-school-fed-challenge",
            "National Economics Challenge: Tests students' knowledge of microeconomics, macroeconomics, and international economics. Teams of students work through multiple-choice questions and critical thinking scenarios, competing at regional and national levels. Open to grades 9-12 https://www.councilforeconed.org/programs/for-students/national-economic-challenge/"
        ],
        "Fashion": [
            "Fashion Reimagined: Challenges participants to create innovative and environmentally-friendly fashion designs with the goal of reducing waste and promoting a more circular fashion industry. The competition encourages designers to think creatively and push the boundaries of sustainable fashion. Open to grades 9-12 https://liu.edu/fashion-reimagined",
            "Taiwan Fashion Design Award (TFDA): Prestigious international design competition that aims to discover and nurture emerging talent in the fashion industry, providing a platform for young designers to showcase their creativity, innovation, and technical skills. Open to grades 9-12 https://www.roc-taiwan.org/my_en/post/10591.html"
        ],
        "Film": [
            "C-SPAN’s StudentCam Documentary Competition: Annual documentary competition where students create short films on a political or civic issue, exploring its impact on their lives and our nation. Open to grades 6-12 https://www.studentcam.org", 
            "Slingshot Challenge: Students are challenged to create 1-minute videos describing their ideas for solving environmental issues around the world. Open to ages 13-18 https://www.nationalgeographic.org/society/projects/slingshot/",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18) https://youngarts.org/",
            "Young Filmmakers Contest: Challenges students to create short films, typically focusing on specific themes such as environmental issues or social causes. Participants are encouraged to develop their storytelling and technical skills in video production. Open to ages 25 and under https://www.oneearthfilmfest.org/contest-details"
        ],
        "General": [
            "Academic Decathlon: Comprehensive academic competition that challenges students to demonstrate their knowledge and skills in a wide range of subjects, including mathematics, science, literature, history, economics, music, and art, as well as speech, interview, and essay writing. Provides a unique opportunity for students to develop their skills, build confidence, and prepare for success in college and beyond.. Open to grades 9-12 https://www.usad.org/",
            "Destination Imagination: International program that fosters creativity, teamwork, and problem-solving skills in students. Participants work in teams to tackle open-ended challenges in various categories, including Science, Technology, Engineering, Arts, and Mathematics (STEAM). Open to grades K-12 https://www.destinationimagination.org/challenge-experience/",
            "Disney Dreamers Academy (Difficulty ★★★★☆): Empowers students to explore their dreams and career aspirations through mentorship, workshops, and networking opportunities. Participants gain hands-on experience and inspiration in various fields, preparing them for future success. Open to grades 9-12 https://www.disneydreamersacademy.com/", 
            "National Academic League: Teams of students compete across a wide range of subjects through challenges that test teamwork and problem-solving. Students compete in head-to-head rounds, testing their quick recall and critical thinking in a fast-paced, quiz-style format. Open to grades 9-12 https://nationalacademicleague.org/",
            "National Science Bowl: Tests students’ knowledge in a competition where teams face-off in a fast-paced Q&A format, involving scientific topics such as biology, chemistry, earth science, physics, energy, and math. Open to grades 6-12 https://www.energy.gov/topics/national-science-bowl", 
            "Quiz Bowl: Academic competition where teams of students compete to answer questions across a wide range of subjects, including history, literature, science, fine arts, current events, popular culture, and sports. Using a buzzer system, teams rapidly respond to questions. Open to grades 6-12 https://www.naqt.com/about/quiz-bowl.html",
            "Regeneron International Science and Engineering Fair (ISEF): World's largest pre-college STEM research competition, where high school students present groundbreaking independent research across various scientific categories. Open to grades 9-12 and requires qualification from local and state fairs https://www.societyforscience.org/isef/", 
            "Science Olympiad: Challenges students in teams to compete in a series of events covering scientific topics such as biology, chemistry, physics, engineering, and earth science. The event fosters teamwork and problem-solving skills, with students participating in both written and build challenges. Open to grades 6-12 https://www.soinc.org/"
        ],
        "History": [
            "AFSA National High School Essay Contest: Challenges students to analyze and write about foreign policy and diplomacy, encouraging a deeper understanding of international affairs. Open to grades 9-12 https://afsa.org/essay-contest", 
            "Profile in Courage Essay Contest by JFK Presidential Library: Invites students to describe and analyze an act of political courage by a US elected official who served during or after 1917, the year JFK was born. Open to grades 9-12 https://www.jfklibrary.org/learn/education/profile-in-courage-essay-contest", 
            "National History Bowl: Quiz competition that tests teams of students on their knowledge of global history across a wide selection of eras. Students form teams of 6 students in this buzzer-based competition. Open to grades 12 and under https://www.iacompetitions.com/vjvhistorybowl/",
            "World Historian Student Essay Competition: Invites students to address how global historical topics leave impacts on the modern world, encouraging deep research and critical thinking. Open to grades K-12 https://www.thewha.org/wha-awards/world-historian-student-essay-competition/#!"
        ],
        "Math": [
            "American Invitiational Mathematics Examination (AIME) (Difficulty ★★★★☆): Tests students’ problem-solving and mathematical reasoning abilities through 15 multiple-choice questions, and top scorers are eligible for further rounds of competition. Must qualify through AMC 10 or AMC 12 https://artofproblemsolving.com/wiki/index.php/American_Invitational_Mathematics_Examination", 
            "American Mathematics Competition 10 (AMC 10) (Difficulty ★★★☆☆): Challenges students by testing their problem-solving skills and mathematical reasoning through 25 multiple-choice questions. Open to grades 10 and under https://maa.org/student-programs/amc/", 
            "American Mathematics Competition 12 (AMC 12) (Difficulty ★★★☆☆): Challenges students by testing their problem-solving skills and mathematical reasoning through 25 multiple-choice questions. Open to grades 12 and under https://maa.org/student-programs/amc/",
            "American Regions Mathematics League (ARML): Brings together teams of students from different regions to compete in a series of challenging mathematical events, including individual and team tests, as well as a power question that requires collaborative problem-solving. Open to grades 9-12 https://arml3.com/",
            "COMAP's High School Mathematical Contest in Modeling (HiMCM): Challenges high school students to solve real-world problems using mathematical models. Teams of students collaborate to analyze the problem, create a model, and write a detailed report explaining their solution. Open to grades 12 and under https://www.comap.com/contests/himcm-midmcm", 
            "InteGIRLS Math Competitions: Competitions designed specifically for girls, with the goal of encouraging and empowering young women to pursue their interests and develop their skills in mathematics. Students attempt challenging mathematical problems, learn from each other, and develop their critical thinking and problem-solving skills. Open to girls in grades 12 and under https://www.integirls.org/math-competitions", 
            "Math Kangaroo Competition: Promotes mathematical thinking and problem-solving skills, offering students a chance to compete at multiple levels with a variety of engaging and thought-provoking problems. Open to grades 12 and under https://mathkangaroo.org/mks/", 
            "Math League: Enhance students' problem-solving abilities through challenging questions in various mathematical topics such as algebra, geometry, and number theory. Open to grades 3-12 https://www.mathleague.org/", 
            "Mathworks Math Modeling Challenge (M3) (Difficulty ★★★★★): Nationwide competition where teams work together to develop mathematical models for solving real-world problems within a limited time frame. Students apply their creativity and mathematical skills to propose solutions and present their findings in a detailed report. Open to grades 11-12 https://m3challenge.siam.org/", 
            "National High School Ethics Bowl: Challenges teams of students to discuss and debate complex ethical dilemmas, with the goal of developing their critical thinking, moral reasoning, and communication skills. The competition features a series of case studies and scenarios that raise important ethical questions, and teams must work together to analyze the issues and develop well-reasoned arguments. Open to grades 9-12 https://nhseb.org/",
            "Purple Comet! Math Meet!: Global math competition where teams  work together to solve a series of challenging problems in various mathematical areas, including algebra, geometry, and combinatorics. Open to grades 6-12 https://purplecomet.org/"
        ],
        "Music": [
            "Global International Music Competition: Students from around the world showcase their musical talents in various categories such as instrumental, vocal, and composition. Participants are judged on their technique, artistry, and creativity, with top performers receiving prizes and the chance to perform in international settings. Open to ages 6 and older https://www.internationalmusiccompetition.org/#/",
            "Music Teachers National Association (MTNA) Competitions: Prestigious series of music competitions, including piano, strings, woodwinds, brass, voice, and composition. High school students compete at regional, state, and national levels, demonstrating their technical ability and musical interpretation. Open to grades 6-12 https://www.mtna.org/MTNA/Engage/Competitions/Competitions.aspx",
            "SF International Innovative Music Competition: Global event where students showcase their musical talents, focusing on innovative and unique approaches to performance or composition. Participants perform or compose pieces that demonstrate creativity, technical skill, and originality. Open to ages 6 and older https://bayareamusicassociation.org/events/competitions/sf-international-music-competition/",
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18) https://youngarts.org/"
        ],
        "Nature & Environmental Science": [
            "Genius Olympiad: Invites students to present innovative projects in the field environmental science. Participants submit projects that aim to address global challenges, and winners receive recognition, scholarships, and the opportunity to attend the event in person to present their ideas. Open to grades 9-12 https://geniusolympiad.org/",
            "Rachel Carson Intergenerational Sense of Wonder/Sense of the Wild Contest: Encourages participants to explore and celebrate the natural world through writing, art, or other forms of expression. Aims to foster environmental awareness and appreciation, inspired by the legacy of environmentalist Rachel Carson. Must have an intergenerational team (team with multiple generations of people) https://rachelcarsonlandmarkalliance.org/rachel-carson-intergenerational-sense-of-wonder-sense-of-the-wild-contest-2022/",
            "Slingshot Challenge: Students are challenged to create 1-minute videos describing their ideas for solving environmental issues around the world. Open to ages 13-18 https://www.nationalgeographic.org/society/projects/slingshot/"
        ],
        "Physics": [
            "Beamline for Schools Competition: Students are challenged to propose an experiment that they would like to conduct using a particle accelerator, with the winning teams given the opportunity to carry out their experiment at a real research facility. The competition aims to inspire and educate students about the wonders of particle physics. Open to grades 9-12 https://beamlineforschools.cern/", 
            "F=ma Physics Competition (Difficulty ★★★★★): National exam organized by the American Association of Physics Teachers (AAPT) that serves as the preliminary selection for the U.S. Physics Team. Tests students' knowledge in Newtonian mechanics, including topics such as kinematics, dynamics, energy, momentum, and rotational motion. Open to grades 9-12 https://aapt.org/physicsteam/2024/index.cfm",
            "Physics Bowl (Difficulty ★★★☆☆): National competition where students take a 40-question, 45-minute multiple-choice exam covering topics in physics, ranging from mechanics to electricity and magnetism, with divisions based on years of physics experience. Open to grades 9-12 https://www.aapt.org/programs/physicsbowl/",
            "Sir Isaac Newton Exam: Annual physics contest organized by the University of Waterloo's Department of Physics & Astronomy, designed to promote physics education through challenging and engaging problems. Participants must ask their teacher to register for them. Open to grades 9-12 https://uwaterloo.ca/sir-isaac-newton-exam/",
            "US Invitational Young Physicists Tournament (USIYPT): Prestigious physics competition that challenges high school students to investigate, analyze, and present on complex physics problems, with a focus on developing critical thinking, research, and communication skills. Features problems that require students to conduct experiments, collect data, and develop theoretical models to explain and predict physical phenomena. Open to grades 9-12 https://www.usaypt.org/",
            "USA Physics Olympiad (USAPhO) (Difficulty ★★★★★): Students from around the U.S. solve theoretical and experimental problems that test deep understanding, creativity, and analytical skills in physics. Participants typically qualify through the F=ma Physics Competiton. Open to grades 9-12 https://www.ipho-new.org/"
        ],
        "Robotics": [
           "Vex V5 Robotics Competition: Challenges students to design, build, and program robots to compete in annual engineering challenges. Each year introduces a new game that requires teams to develop innovative solutions, fostering skills in teamwork, problem-solving, and STEM. Open to grades 6-12 https://www.robotevents.com/robot-competitions/vex-robotics-competition"
        ],
        "STEM Research": [
            "Davidson Fellows Scholarship (Difficulty ★★★★★): Awards huge scholarships to exceptional young individuals who have completed significant projects with the potential to benefit society in areas such as science, technology, engineering, mathematics, literature, music, and philosophy. Open to ages 18 or younger https://www.davidsongifted.org/gifted-programs/fellows-scholarship/",
            "Engineer Girl Annual Essay Contest: Encourages students to explore engineering's impact on society by researching and writing about real-world engineering challenges. Open to grades 3-12 https://www.engineergirl.org/154382/2025-Writing-Contest-Innovating-Smarter", 
            "Exploravision: Annual science competition that encourages students to envision new technology 10 or more years in the future through collaborative brainstorming and research of current science and technology. Open to grades K-12 https://www.competitionsciences.org/competitions/exploravision/",
            "Junior Science and Humanities Symposium: Students conduct original scientific research in STEM fields and present their findings to a panel of experts. Participants compete at regional and national levels, with opportunities for scholarships and recognition. Open to grades 9-12 https://www.competitionsciences.org/competitions/junior-science-and-humanities-symposium/", 
            "Plant the Moon Challenge: Students experiment with lunar soil simulant to develop plant growth strategies for future space missions. Participants conduct research, analyze data, and present their findings to help advance space agriculture. Open to grades 9-12 and college https://plantthemoon.com/home/", 
            "Regeneron International Science and Engineering Fair (ISEF): World's largest pre-college STEM research competition, where high school students present groundbreaking independent research across various scientific categories. Open to grades 9-12 and requires qualification from local and state fairs https://www.societyforscience.org/isef/", 
            "Regeneron Science Talent Search: Nation’s most prestigious science and math competition for high school seniors, recognizing outstanding independent research. Open to only grade 12 https://www.societyforscience.org/regeneron-sts/", 
            "Stockholm Junior Water Prize: International competition that challenges high school students to conduct research on water-related issues, including water quality, resource management, and sustainability. Open to ages 15-20 https://siwi.org/stockholm-junior-water-prize/"
        ],
        "Theater": [
            "Princeton University Ten-Minute Play Contest: Invites students to submit original short plays, encouraging creativity in young playwrights to explore unique narratives and compelling dialogue. Open to only grade 11 https://arts.princeton.edu/about/opportunities/high-school-contests/ten-minute-play-contest/", 
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18) https://youngarts.org/"
        ],
        "Writing": [
            "Jane Austen Society Essay Contest: Invites students to analyze and write about themes, characters, and historical contexts in Jane Austen’s works, fostering a deeper appreciation for her literature. Open to grades 9-12 https://jasna.org/programs/essay-contest/", 
            "John Locke Institute Essay Competition: Encourages students to develop the characteristics that create into great writers: independent thought, depth of knowledge, clear reasoning, critical analysis and persuasive style while exploring a wide range of interesting questions. Open to ages 15-18 https://www.johnlockeinstitute.com/essay-competition", 
            "National Scholastic Art & Writing Awards: Recognizes creative excellence in writing, offering students opportunities for scholarships and national recognition. Open to grades 7-12 https://www.artandwriting.org/awards/how-to-enter/", 
            "Princeton Leonard L. Milberg ’53 High School Poetry Prize: Recognizes outstanding work by student writers, encouraging students to showcase their talent and creativity through the power of poetry. Open to only grade 11 https://arts.princeton.edu/about/opportunities/high-school-contests/poetry-contest/", 
            "SPJ/JEA High School Essay Contest: Prompts students to explore the importance of journalism and the First Amendment's freedom of press by writing essays on a given prompt. Open to grades 9-12 https://jea.org/awards/spj-jea-high-school-essay-contest/", 
            "The Bennington Young Writers Awards: Invites students to submit original poetry, fiction, and nonfiction works, providing an opportunity for young writers to showcase their creativity and literary talent. Open to grades 9-12 https://www.bennington.edu/events/young-writers-awards", 
            "YoungArts: Encourages young artists to submit work in various categories, including visual arts, writing, film, music and theater. Selected winners receive scholarships, mentorship, and performance opportunities along with the chance to participate in exclusive workshops. Open to grades 10-12 (ages 15-18) https://youngarts.org/"
        ],
        "Volunteering":[
            "The President's Volunteering Service Award (PVSA): Rewards students who have demonstrated a commitment to volunteering over the time frame of a year. Open to all ages. Hour Requirements for bronze, silver, and gold medals vary by age. https://presidentialserviceawards.gov/"
        ]
    }
}
